'''сортировка с помощью lambda функции в key='''
a = [1, 4, 567, 345, 1, 96, 5678, 245, 567, 13000]

# обычная сортировка по возрастанию
a.sort()
print(a)  # [1, 1, 4, 96, 245, 345, 567, 567, 5678, 13000]

# сортировка по последней цифре числа
a.sort(key=lambda x: x % 10)
print(a)  # [13000, 1, 1, 4, 245, 345, 96, 567, 567, 5678]

# сортировка по ПРЕДпоследней цифре числа
a.sort(key=lambda x: x // 10 % 10)
print(a)  # [13000, 1, 1, 4, 245, 345, 96, 567, 567, 5678]

# оператор if с помощью lambda функции
var = lambda x: True if x > 0 else False
